from sklearn.preprocessing import MinMaxScaler

testlist = [[14488, 7.153469, 1673904],
 [26052, 1.441871, 0.805124],
 [75136, 13.147394, 0.428964],
 [38244, 1.669788, 0.134296],
 [72993, 10.141740, 1.032955],
 [35948, 6.830792, 1.213192],
 [42666, 13.276369, 0.543880],
 [67497, 8.631557, 0.749278],
 [35483, 12.273169, 1.508053],
 [50242, 3.723498, 0.83191]]

def Mm():
    """
    归一化处理
    :return: None
    """
    mm = MinMaxScaler()
    data = mm.fit_transform(testlist)
    print(data)


if __name__ == '__main__':
    Mm()